# GetTaggedLocalElement Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..GetTaggedLocalElement Method
IndependentTag Class See Also
---
Get the tagged local element, if any. If the tag is tagged on a subelement of local element, it returns the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElements()` method instead.")]
public Element GetTaggedLocalElement()
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElements()` method instead.")> _
Public Function GetTaggedLocalElement As Element
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedLocalElements()` method instead.")]
public:
Element^ GetTaggedLocalElement()
```

# ### Return Value
The tagged element from the local document, or nullNothingnullptra null reference (Nothing in Visual Basic) for orphan tags and tagged elements in linked documents.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace